#### CanMirrorElements Method

---

|  |
| --- |
| ElementTransformUtils Class   See Also |

Determines whether elements can be mirrored.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool CanMirrorElements( 	Document ADoc, 	ICollection<ElementId> elemIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CanMirrorElements ( _ 	ADoc As Document, _ 	elemIds As ICollection(Of ElementId) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool CanMirrorElements( 	Document^ ADoc,  	ICollection<ElementId^>^ elemIds ) ``` |

#### Parameters

ADoc
:   Type:  Autodesk.Revit.DB Document
     The document where the elements reside.

elemIds
:   Type:  System.Collections.Generic ICollection   ElementId
     The elements identified by id.

#### Return Value

True if the elements can be mirrored.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ElementTransformUtils Class

Autodesk.Revit.DB Namespace